Revit 2027 API
PolylineSegments.StartLocalParameter Property
 Local parameter associated with the start point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartLocalParameter { get; }
Public ReadOnly Property StartLocalParameter As Double
	Get
public:
property double StartLocalParameter {
	double get ();
}
member StartLocalParameter : float with get
Property Value
Double
See Also
Reference
PolylineSegments Class
Autodesk.Revit.DB Namespace